{"Title":"Cat People","Year":"1942","Rated":"Not Rated","Released":"25 Dec 1942","Runtime":"73 min","Genre":"Fantasy, Horror, Thriller","Director":"Jacques Tourneur","Writer":"DeWitt Bodeen","Actors":"Simone Simon, Kent Smith, Tom Conway, Jane Randolph","Plot":"Serbian national Irena Dubrovna, a fashion sketch artist, has recently arrived in New York for work. The first person who she makes a personal connection with there is marine engineer Oliver Reed. The two fall in love and get married despite Irena's reservations, not about Oliver but about herself. She has always felt different than other people, but has never been sure why. She lives close to the zoo, and unlike many of her neighbors is comforted by the sounds of the big cats emanating from the zoo. And although many see it purely as an old wives' tale, she believes the story from her village of ancient residents being driven into witchcraft and evil doing, those who managed to survive by escaping into the mountains. After seeing her emotional pain, Oliver arranges for her to see a psychiatrist to understand why she believes what she does. In therapy, Dr. Judd, the psychiatrist, learns that she also believes, out of that villagers' tale, that she has descended from this evil - women who change into great cats like panthers in passion, anger or jealousy - and that she will turn into a such a dangerous big cat upon being kissed in turn killing her lover and others who have betrayed her. This belief is why she has resisted falling in love before she met Oliver. Learning this information from Irena, Oliver wants to do whatever needed to help her as does Dr. Judd. But Irena's beliefs may be tested when Oliver's friendship with a co-worker named Alice Moore may become more than just friends...","Language":"English, Czech, Serbian","Country":"USA","Awards":"1 win & 3 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BNzI4YWY0NWQtNWI5YS00MGE4LWE4YTgtMzBmOWIwMzdiYTRiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.3/10"},{"Source":"Rotten Tomatoes","Value":"95%"}],"Metascore":"N/A","imdbRating":"7.3","imdbVotes":"19,401","imdbID":"tt0034587","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"RKO Radio Pictures Inc.","Website":"N/A","Response":"True"}