{"Title":"The Talk of the Town","Year":"1942","Rated":"Approved","Released":"20 Aug 1942","Runtime":"118 min","Genre":"Comedy, Drama, Romance, Thriller","Director":"George Stevens","Writer":"Irwin Shaw (screen play), Sidney Buchman (screen play), Dale Van Every (adaptation), Sidney Harmon (based on a story by)","Actors":"Cary Grant, Jean Arthur, Ronald Colman, Edgar Buchanan","Plot":"In suburban Lochester, New England, three people end up living together in high school teacher Nora Shelley's rental house. The first is her new tenant, renowned Harvard law professor Michael Lightcap, who has rented the house for the summer while he writes his new book. The second is Nora herself. Despite having an auspicious first meeting, Lightcap hires Nora to be his live-in cook and secretary for a week until his manservant Tilney arrives. The third is Joseph, the property's gardener, who is currently laid up with a sprained ankle. In reality, Joseph is Nora's childhood friend Leopold Dilg, who has just escaped from prison. Leopold was being tried for the arson of the factory where he worked, and for murder for the death of the factory foreman Clyde Bracken, whose body was never recovered but who is assumed to have died in the fire. Despite the danger to herself, Nora hides Leopold since she believes his story that although he, as an activist, did speak out about the dangerous conditions at the factory, he did not set the fire, which he assumes was done by the factory's owner, Andrew Holmes, to collect the insurance money, all the while having Leopold as a scapegoat. Nora campaigned to get the job with Lightcap if only to be able to better hide Leopold in the house. Leopold escaped if only because he knew he would not get a fair trial due to the rabble rousing being conducted by Holmes against him. Lightcap and who he knows as Joseph end up getting along famously, although activist Leopold believes Lightcap's view of the law is too clinical for him truly to be a great lawyer or great judge, those thoughts arising if only because Nora and Leopold learn clandestinely that Lightcap is being appointed to the Supreme Court. Nora, Leopold and Leopold's lawyer, Sam Yates, try to get Lightcap involved in helping Leopold by showing him that Leopold indeed will not get a fair trial. In the process, Lightcap may in turn show Leopold and Nora that his current way of thinking has much merit.","Language":"English","Country":"USA","Awards":"N/A","Poster":"https://m.media-amazon.com/images/M/MV5BMDYyOTc0ZjItMmU5YS00Mjk0LTk0NTUtMmJhMWZmMDc5ZGU2XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.5/10"},{"Source":"Rotten Tomatoes","Value":"94%"}],"Metascore":"N/A","imdbRating":"7.5","imdbVotes":"7,325","imdbID":"tt0035417","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Columbia Pictures Corporation","Website":"N/A","Response":"True"}