{"Title":"When Worlds Collide","Year":"1951","Rated":"Approved","Released":"15 Nov 1951","Runtime":"83 min","Genre":"Action, Sci-Fi, Thriller","Director":"Rudolph Maté","Writer":"Sydney Boehm (screenplay), Edwin Balmer (novel), Philip Wylie (novel)","Actors":"Richard Derr, Barbara Rush, Peter Hansen, John Hoyt","Plot":"South African bush pilot and carefree ladies man Dave Randall finds he has been let in on the greatest and most terrible secret in the world when an eminent astronomer pays him to deliver some mysterious photos from to an equally prominent colleague in the U.S. The recipient, Dr. Hendron, confirms the awful findings of the sender: the star Bellus will collide with Earth, destroying our planet. Despite widespread disbelief, Marston and Spiro, a pair of millionaire philanthropists, give Dr. Hendron all their assets to begin construction on a huge rocket ship that will, at least theoretically, transport a nucleus of survivors to Zyra, a planet which orbiting Bellus that may or may not be habitable. The funds aren't enough to complete the spaceship, and Dr. Hendron solicits a contribution from elderly wheelchair-bound tycoon Sydney Stanton, a wheelchair-bound old man who, unlike the selfless Marston and Spiro, demands a place on the rocket, even though space and weight will be too precious for anyone but young, skilled men and women. Even as doomsday approaches, Randall is surprised to find himself in a love triangle with Dr. Hendron's daughter and her fiancé. Humanity is in peril, and only a modern-day Noah's ark, and the continued need of a man for a woman, can save it.","Language":"English, French, Portuguese, Spanish","Country":"USA","Awards":"Won 1 Oscar. Another 1 nomination.","Poster":"https://m.media-amazon.com/images/M/MV5BNDE2MGEwZDMtNGU3OC00NTA5LWJkMmQtMTg0ODlkM2Y0YTFhL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.6/10"},{"Source":"Rotten Tomatoes","Value":"78%"}],"Metascore":"N/A","imdbRating":"6.6","imdbVotes":"7,100","imdbID":"tt0044207","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Paramount","Website":"N/A","Response":"True"}