{"Title":"Hush... Hush, Sweet Charlotte","Year":"1964","Rated":"Not Rated","Released":"20 Jan 1965","Runtime":"133 min","Genre":"Crime, Drama, Mystery, Thriller","Director":"Robert Aldrich","Writer":"Henry Farrell (screenplay), Lukas Heller (screenplay), Henry Farrell (story)","Actors":"Bette Davis, Olivia de Havilland, Joseph Cotten, Agnes Moorehead","Plot":"Aged, wealthy Charlotte Hollis has lived as a recluse in the crumbling family plantation mansion in Hollisport, Louisiana since her father Sam Hollis' death thirty-six years ago. The only people who regularly see her are her hard-as-nails but seemingly loyal housekeeper, Velma Crowther, and her longtime friend and physician, Dr. Drew Bayliss. She has lived there most of her life except for a short stint in London thirty-seven years ago following the vicious murder of her married lover, John Mayhew, at the plantation's summer house while Sam was hosting one of his legendary grand balls in the mansion. She and John had planned to run off together that night, but instead he was bludgeoned to death, his head and right hand severed from his body. Nobody was ever convicted for his murder, but most people believe Charlotte did it after John changed his mind about running off with her. They also believe that Charlotte, whom they haven't seen in years, is a crazy old woman. Conversely, Charlotte has hidden away fearing that people would always be glaring at her. She believes that any bad thing that has happened to her since John's murder has been initiated by his widow, Jewel Mayhew, whom she blames for orchestrating the expropriation of her property to build a bridge across the lake. Charlotte is surprised that her younger cousin Miriam Deering, who left the area years ago and was once Drew's romantic interest, has accepted her invitation to stay at the mansion. While Charlotte wanted Miriam to help her overturn the expropriation with the state government in Baton Rouge, Miriam has actually come to help her pack her belongings. Her visit coincides with the arrival to Hollisport of insurance investigator Harry Willis, who has always wondered why the insurance was never claimed. Not expecting to find anything serious, he tells only Sheriff Luke Standish the true nature of his visit. By this time, Charlotte's mental state seemingly hits a sharp decline, perhaps because she would be leaving her family home, but could it be issues surrounding John's murder? Or is someone trying to drive her crazy if she isn't already? If the latter, the truth of who killed John and why may finally come to light to those who matter.","Language":"English","Country":"USA","Awards":"Nominated for 7 Oscars. Another 3 wins & 2 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BMzU4YjNlNGUtN2ZkNy00OTkwLTkyMWUtZmZiNDMzNDA4N2ZkXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.6/10"},{"Source":"Rotten Tomatoes","Value":"82%"}],"Metascore":"N/A","imdbRating":"7.6","imdbVotes":"12,752","imdbID":"tt0058213","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"The Associates &amp; Aldrich Company Inc.","Website":"N/A","Response":"True"}