{"Title":"Barefoot in the Park","Year":"1967","Rated":"G","Released":"25 May 1967","Runtime":"106 min","Genre":"Comedy, Romance","Director":"Gene Saks","Writer":"Neil Simon (play), Neil Simon (screenplay)","Actors":"Robert Redford, Jane Fonda, Charles Boyer, Mildred Natwick","Plot":"New Yorkers Paul Bratter and Corie Bratter née Banks have just gotten married. He is a stuffed shirt just starting his career as a lawyer. She is an independently minded free spirit who prides herself on doing the illogical purely out of a sense of adventure, such acts as walking through Washington Square Park barefoot when it's 17°F outside. Their six day honeymoon at the Plaza Hotel shows that they can get to know each other easily in the biblical sense. But they will see if they can get to know each other in their real life when they move into their first apartment, a cozy (in other words, small), slightly broken down top floor unit in a five story walk-up. While Corie joyfully bounds up and down the stairs, Paul, always winded after the fact, hates the fact of having to walk up the six flights of stairs, if one includes the stairs that comprise the outside front stoop. Beyond the issues with the apartment itself, Paul and Corie will have to deal with an odd assortment of neighbors, most specifically eccentric senior Victor Velasco, who lives in the unusual attic and who would like to consider himself a dirty old man. Corie, worried about her single straight-laced mother Ethel Banks, wants to set her up with Victor. Without Corie or Paul truly realizing it, Ethel and Victor as a twosome is as illogical as Corie and Paul. What happens between Ethel and Victor may be a predictor if Corie and Paul's marriage can make it in the long run.","Language":"English","Country":"USA","Awards":"Nominated for 1 Oscar. Another 6 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BNjJiNzhkNGYtNDRhNi00NjNjLWJmZGEtOTQ1ZDM2NDM0ODgzXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.0/10"},{"Source":"Rotten Tomatoes","Value":"84%"},{"Source":"Metacritic","Value":"55/100"}],"Metascore":"55","imdbRating":"7.0","imdbVotes":"16,195","imdbID":"tt0061385","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Paramount Pictures, Hal Wallis Productions","Website":"N/A","Response":"True"}