{"Title":"What's Up, Tiger Lily?","Year":"1966","Rated":"PG","Released":"02 Nov 1966","Runtime":"80 min","Genre":"Adventure, Comedy, Crime, Thriller","Director":"Woody Allen, Senkichi Taniguchi","Writer":"Woody Allen (special material by), Frank Buxton (with writings by), Louise Lasser (with writings by), Julie Bennett (with writings by), Len Maxwell (with writings by), Mickey Rose (with writings by), Bryna Wilson (with writings by), Hideo Andô (written by: original Japanese version), Ben Shapiro (production conception)","Actors":"Woody Allen, The Lovin' Spoonful, Frank Buxton, Louise Lasser","Plot":"Writer/director Woody Allen explains that when he was asked to supervise the making of the definitive spy thriller, what he decided to do was acquire the rights to a B-grade Japanese spy caper (Key of Keys (1965)) filmed with Japanese actors in Japanese, delete the existing soundtrack, and redub into English and reorder select scenes to create an entirely new movie, a comedy, having nothing to do with the original story-line. The result... International spy Phil Moscowitz, working out of the Asia bureau, is a self-professed lovable rogue with sex always on his mind. He inadvertently gets involved in a mission, the client the Grand Exalted High Majah of Raspur. The success of the mission will determine if Raspur, a non-existent country that nonetheless sounds real, will indeed become real. Moscowitz is to retrieve something stolen from the Majah by criminal Shepherd Wong: the best ever egg salad recipe. Phil is to be assisted by two of the Majah's own agents, sisters Teri and Suki Yaki, the latter a recent prison escapee. The mission becomes more difficult when they learn that Shepherd is an egg salad junkie who will do anything to keep the recipe. The mission gets even more complicated when they also learn that they are in competition to retrieve the recipe by Wing Fat, another criminal who plans to steal the recipe then sell it back to addicted Shepherd. The success or failure of the mission for Phil and the Yaki sisters may be dependent if they receive the extra help needed from the audience and the projectionist at the cinemas where the movie is playing.","Language":"English, Japanese","Country":"Japan, USA","Awards":"N/A","Poster":"https://m.media-amazon.com/images/M/MV5BYWNhNjM2NzQtMzdlMi00MTZiLWJkYmEtZmYzMjFlMDk3Zjg5XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.9/10"},{"Source":"Rotten Tomatoes","Value":"81%"},{"Source":"Metacritic","Value":"63/100"}],"Metascore":"63","imdbRating":"5.9","imdbVotes":"8,949","imdbID":"tt0061177","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"N/A","Website":"N/A","Response":"True"}