{"Title":"The Getaway","Year":"1972","Rated":"PG","Released":"16 Dec 1972","Runtime":"123 min","Genre":"Action, Crime, Thriller","Director":"Sam Peckinpah","Writer":"Walter Hill (screenplay), Jim Thompson (novel)","Actors":"Steve McQueen, Ali MacGraw, Ben Johnson, Sally Struthers","Plot":"Carter \"Doc\" McCoy is a career robber, currently in his fourth year of a ten year prison sentence at the Texas State Penitentiary. After his request for parole is denied despite he being a model prisoner, Doc, unable emotionally to endure life inside, asks his loving wife Carol McCoy to contact crooked businessman Jack Beynon, a man with political connections, to secure his release in return for he being \"for sale\" to Beynon. Beynon is able to get Doc released, the sale price being for Doc to plan and execute a robbery at a small bank branch in Beacon City, Texas where Beynon knows that $750,000 will be kept in the vault for the next two weeks. Rather than Doc using his own men for the job, Beynon directs that the only other people involved will be the men of his own choosing, Rudy and Frank. There are to be no casualties, which is all right with Doc who is not a murderer. After the robbery is completed and the monies divvied up accordingly, Doc and Carol will cross the border into Mexico to live out their lives away from capture. The robbery doesn't come off quite according to Doc's plan, with the result being Doc and Carol going on the run as they try to make their way into Mexico with their share of the loot. Various people are in their pursuit, some who know that they will try to cross into Mexico at one of the two major West Texas border crossings. Other bystanders get directly or indirectly involved in the proceedings, which affects what happens. Two of those people, seeming straight-laced couple Fran and Harold Clinton, get involved more intimately than would have been first anticipated. Though it all, Doc and Carol have to work through some of their own issues, which arise out of a revelation about Doc's release from prison.","Language":"English, Spanish","Country":"USA","Awards":"Nominated for 1 Golden Globe. Another 1 win & 2 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BZWU1NDNmZTAtNDlhYy00MmY0LTlhMWUtZGNiNzA2ODA5MDY1XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.4/10"},{"Source":"Rotten Tomatoes","Value":"86%"},{"Source":"Metacritic","Value":"55/100"}],"Metascore":"55","imdbRating":"7.4","imdbVotes":"27,423","imdbID":"tt0068638","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"First Artists","Website":"N/A","Response":"True"}