{"Title":"Amarcord","Year":"1973","Rated":"R","Released":"19 Sep 1974","Runtime":"123 min","Genre":"Comedy, Drama","Director":"Federico Fellini","Writer":"Federico Fellini (story), Tonino Guerra (story), Federico Fellini (screenplay), Tonino Guerra (screenplay)","Actors":"Pupella Maggio, Armando Brancia, Magali Noël, Ciccio Ingrassia","Plot":"One year in a small northern Italian coastal town in the late 1930s is presented. The slightly off-kilter cast of characters are affected by time and location, the social mores dictated largely by Catholicism and the national fervor surrounding Il Duce aka Benito Mussolini and Fascism. The stories loosely center on a mid-teen named Titta and his household including his adolescent brother, his ever supportive mother who is always defending him against his father, his freeloading maternal Uncle Lallo, and his paternal grandfather who slyly has eyes and hands for the household maid. Other townsfolk include: Gradisca, the town beauty, who can probably have any man she wants, but generally has no one as most think she out of their league; Volpina, the prostitute; Giudizio, the historian; a blind accordionist; and an extremely buxom tobacconist. The several vignettes presented include: the town bonfire in celebration of spring; life at Titta's school with his classmates and teachers; Aurelio, Titta's father, at his beachfront construction worksite and his and his workmates' encounter with Volpina; Titta's confessions to the priest about his burgeoning sexuality; Aurelio being questioned by authorities about his anti-Fascist leanings; a fantasy sequence at the luxurious Grand Hotel; a family outing with Aurelio's institutionalized brother, Teo; many townsfolk embarking on a sail to witness a marine event passing by their town; an annual car race; Titta's fantasy encounter with the tobacconist after closing hours come true; events surrounding the big snowfall that year, including a family tragedy; and an event centering on Gradisca and her future.","Language":"Italian, Greek,  Ancient (to 1453)","Country":"Italy, France","Awards":"Won 1 Oscar. Another 19 wins & 8 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BZDI2OTg2NDQtMzc0MC00MjRiLWI1NzAtMjY2ZDMwMmUyNzBiXkEyXkFqcGdeQXVyNzM0MTUwNTY@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.9/10"},{"Source":"Rotten Tomatoes","Value":"87%"}],"Metascore":"N/A","imdbRating":"7.9","imdbVotes":"39,340","imdbID":"tt0071129","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"PECF","Website":"N/A","Response":"True"}