{"Title":"Cannibal Holocaust","Year":"1980","Rated":"Unrated","Released":"07 Feb 1980","Runtime":"95 min","Genre":"Adventure, Horror","Director":"Ruggero Deodato","Writer":"Gianfranco Clerici (story and screenplay), Giorgio Stegani (additional dialogue: Italian version)","Actors":"Robert Kerman, Francesca Ciardi, Perry Pirkanen, Luca Barbareschi","Plot":"With the intention to venture into the unexplored areas in the deep jungle of the Amazon rainforest at the border between Brazil and Peru, in 1979, a film crew composed of four young Americans attempted to make a documentary about the never seen before indigenous cannibalistic tribes. However, it's already been two months since anyone last heard from the crew, so without further delay, the noted anthropologist Professor Harold Monroe and his rescue team of the seasoned guide Chaco Losojos and his assistant, embarked on a mission to locate them in the depths of the Green Inferno. Following the Yakumos, a tribe that no white has ever seen before, soon enough, the Professor's rescue party will encounter the elusive Yanomamos or Tree People and the fearsome Shamataris or the Swamp People. Eventually, as more evidence is found concerning the fate of the film crew, the Professor will try to recover the raw footage that was paid in blood, and return it to New York to the executives of the Pan American Broadcasting System who crave to get the riveting unedited footage. What has really happened to the overambitious documentarists, and above all, what was in the final two reels?","Language":"Italian, English, Spanish","Country":"Italy","Awards":"N/A","Poster":"https://m.media-amazon.com/images/M/MV5BN2YyNWI1ZjAtZjZmOC00MDU4LWE0ODktYmMyZmMzZGExZWE4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.9/10"},{"Source":"Rotten Tomatoes","Value":"65%"},{"Source":"Metacritic","Value":"22/100"}],"Metascore":"22","imdbRating":"5.9","imdbVotes":"50,168","imdbID":"tt0078935","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"N/A","Website":"N/A","Response":"True"}