{"Title":"Breaking Away","Year":"1979","Rated":"PG","Released":"20 Jul 1979","Runtime":"101 min","Genre":"Comedy, Drama, Romance, Sport","Director":"Peter Yates","Writer":"Steve Tesich","Actors":"Dennis Christopher, Dennis Quaid, Daniel Stern, Jackie Earle Haley","Plot":"Best friends Dave, Mike, Cyril and Moocher have just graduated from high school. Living in the college town of Bloomington, Indiana, they are considered \"cutters\": the working class of the town so named since most of the middle aged generation, such as their parents, worked at the local limestone quarry, which is now a swimming hole. There is great animosity between the cutters and the generally wealthy Indiana University students, each group who have their own turf in town. The dichotomy is that the limestone was used to build the university, which is now seen as being too good for the locals who built it. Although each of the four is a totally different personality from the other three, they also have in common the fact of being unfocused and unmotivated in life. The one slight exception is Dave. Although he has no job and doesn't know what to do with his life, he is a champion bicycle racer. He idolizes the Italian cycling team so much he pretends to be Italian, much to the chagrin of his parents, especially his used car salesman father, Ray Stoller, who just doesn't understand his son. Dave crosses the unofficial line when he meets and wants to date a IU co-ed named Katherine Bennett, who, intrigued by Dave, in turn is already dating Rod, one of the big men on campus. Dave passes himself off to her as an Italian exchange student named Enrico Gismondi. Beyond Katarina as he calls her, Dave's main immediate focus is that the Italian cycling team have announced that they will be in Indianapolis for an upcoming race, which he intends to enter to be able to race his idols. After an incident at the race, Dave, with a little help from his parents and unwittingly by actions of his friends, has to reexamine his life, what he really wants to get out of it and how best to start achieving it.","Language":"English, Italian, French","Country":"USA","Awards":"Won 1 Oscar. Another 10 wins & 14 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BOGQyNDhiOTAtZGVmOC00MTNkLWE1YzItZGE0NjUzOTcyZTliXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.7/10"},{"Source":"Rotten Tomatoes","Value":"95%"},{"Source":"Metacritic","Value":"91/100"}],"Metascore":"91","imdbRating":"7.7","imdbVotes":"21,502","imdbID":"tt0078902","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Twentieth Century Fox","Website":"N/A","Response":"True"}