{"Title":"Never Cry Wolf","Year":"1983","Rated":"PG","Released":"27 Jan 1984","Runtime":"105 min","Genre":"Adventure, Drama","Director":"Carroll Ballard","Writer":"Farley Mowat (based on the book by), Curtis Hanson (screenplay), Sam Hamm (screenplay), Richard Kletter (screenplay), Charles Martin Smith (narration written by), Eugene Corr (narration written by), Christina Luescher (narration written by)","Actors":"Charles Martin Smith, Brian Dennehy, Zachary Ittimangnaq, Samson Jorah","Plot":"The researcher Tyler is assigned by his government to travel to the Arctic to study the wolves that they believe are responsible for the reduction of the caribou population. The reckless pilot Rosie takes him to the wilderness and he is left alone with his supply in an extremely cold spot. He is saved by the local Ootek that is traveling with his dog sledding. He builds a shelter for Tyler and organizes his supplies. Tyler finds two wolves that he calls George and Angeline and their three offspring and he examines his excrement to learn what they eat. Soon he discovers that the wolves eat only mice and Tyler decides to do the same to prove to the government that the wolves do not eat caribous. Ootek returns with his friend Mike that speaks English and translates what Ootek say. The trio stays together and Tyler learns that Mike is a hunter. Mike travels with Ootek by canoe to see a herd of caribou that is attacked by a pack of wolves. Tyler examines the bones and finds that the animal was diseased, proving that the wolves are responsible for keeping the caribou strong as told by Ootek. Tyler finds Rosie with two hunters planning to explore the area with tourism and Tyler has an argument with the pilot and returns to the camp. He finds the three offspring but the wolves are missing. Tyler initially suspects of Rosie but when he sees the nervous Mike, he finds that he killed the animals.","Language":"English, Inuktitut","Country":"USA","Awards":"Nominated for 1 Oscar. Another 4 wins & 2 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BYmMyMDI1NzctZGUzZi00MDg5LWJkMmItYWM1MzM3M2M0Njk3XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.5/10"},{"Source":"Rotten Tomatoes","Value":"100%"}],"Metascore":"N/A","imdbRating":"7.5","imdbVotes":"7,568","imdbID":"tt0086005","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Walt Disney Pictures","Website":"N/A","Response":"True"}