{"Title":"Godzilla 1985","Year":"1985","Rated":"PG","Released":"23 Aug 1985","Runtime":"87 min","Genre":"Action, Horror, Sci-Fi, Thriller","Director":"Koji Hashimoto, R.J. Kizer, Ishirô Honda, Toshio Masuda, Shûe Matsubayashi, Shirô Moritani","Writer":"Reuben Bercovitch (story \"Godzilla vs. Gargantua\"), Fred Dekker (story Godzilla: King of the Monsters 3D), Akira Murao (story \"The Resurrection of Godzilla\"), Hideichi Nagahara (story), Ryûzô Nakanishi (story Tokyo S.O.S.: Godzilla's Suicide Strategy), Shin'ichi Sekizawa (story \"Godzilla Legend: The Asuka Fortress\"), Tomoyuki Tanaka (story \"The Resurrection of Godzilla\"), Lisa Tomei, Straw Weisman, Hiroyasu Yamaura (story Super Godzilla: God's Angry Messenger)","Actors":"Raymond Burr, Ken Tanaka, Yasuko Sawaguchi, Yôsuke Natsuki","Plot":"A reporter investigates the disappearance of a ship. He finds the ship and discovers that all the hands have been killed by a giant sea louse except for one. The lone survivor then tells the reporter that the ship was attacked by Godzilla (Gojira). Fearing a panic, the Japanese government then takes the survivor into custody to keep him from revealing that Godzilla has returned. However, a Soviet nuclear submarine is destroyed and the situation puts them and the United States on the brink of nuclear war, until the Japanese decide to come clean and admit that it was Godzilla. Soon the Japan and the rest of the world are on red alert as they wait for Godzilla to begin his rampage anew.","Language":"Japanese, Russian, English","Country":"Japan","Awards":"2 wins & 3 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BYmFmNjc1ODgtZjNlNS00NTg1LTg3OWYtYjgwMWM0NWUwMWQwXkEyXkFqcGdeQXVyNjQ2MzU1NzQ@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.3/10"},{"Source":"Rotten Tomatoes","Value":"20%"},{"Source":"Metacritic","Value":"31/100"}],"Metascore":"31","imdbRating":"6.3","imdbVotes":"5,919","imdbID":"tt0087344","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"N/A","Website":"N/A","Response":"True"}