{"Title":"Another Woman","Year":"1988","Rated":"PG","Released":"18 Nov 1988","Runtime":"81 min","Genre":"Drama","Director":"Woody Allen","Writer":"Woody Allen","Actors":"Gena Rowlands, Mia Farrow, Ian Holm, Blythe Danner","Plot":"Having recently turned fifty, Marion feels that she has led a so far blessed life. The well-respected Dean of Philosophy at a women's college, she is currently on sabbatical to write her latest book. Although her first husband Sam died tragically fourteen years ago from a mixture of alcohol and pills, she has recently remarried to Ken, who, married at the time, pursued her, while Ken's writer friend, Larry, also professed his love for her. She has a good relationship with her step-daughter Laura, seemingly better than Laura has with either Ken or Laura's own volatile mother, Kathy. Between her and her brother Paul, Marion always had the attention of their academic father. And she and Ken have a wide circle of friends with who they regularly and willingly socialize. But a series of incidents with these people in her life makes Marion wonder about the decisions that she's made, most specifically whether her cerebral and judgmental nature has been alienating to those around her. One of these incidents is the surprise reunion she has with her best childhood friend, an actress named Claire. But arguably the most illuminating incidents involve encounters with Hope, a despondent patient of her workspace neighbor psychiatrist, whose therapy sessions Marion can hear through the building's ventilation system. The questions become if Marion will fully be able to comprehend the extent to which these decisions have negatively affected her life and relationships, and if so if she can make the necessary changes at this stage in her life path to be more fulfilled.","Language":"English","Country":"USA","Awards":"1 win & 3 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BYWVhMDczZTQtOGMxYS00NmY3LTg1M2QtMDRmYzI3NmMzMTc0XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.3/10"},{"Source":"Rotten Tomatoes","Value":"64%"}],"Metascore":"N/A","imdbRating":"7.3","imdbVotes":"12,383","imdbID":"tt0094663","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Jack Rollins and Charles Joffe","Website":"N/A","Response":"True"}