{"Title":"Above the Law","Year":"1988","Rated":"R","Released":"22 Apr 1988","Runtime":"99 min","Genre":"Action, Crime, Drama, Mystery, Thriller","Director":"Andrew Davis","Writer":"Andrew Davis (story), Steven Seagal (story), Steven Pressfield (screenplay), Ronald Shusett (screenplay), Andrew Davis (screenplay)","Actors":"Steven Seagal, Pam Grier, Henry Silva, Ron Dean","Plot":"In Japan, the Sicilian martial arts expert Nicolo \"Nico\" Toscani is recruited by the CIA Special Agent Nelson Fox to join the Special Operations Forces in the border of the Vietnam and Cambodia. In 1973, Nico witnesses the torturer Kurt Zagon interrogating prisoners of war and he is disgusted and quits the CIA, returning to Chicago. Fifteen years later, Nico is married with a baby with his wife Sarah and they live in the same house of his mother. Nico is a tough and incorruptible narcotics detective of the Chicago Police Department very close to his partner and friend Delores 'Jacks' Jackson and his friend Detective Lukich. When Nico and Jacks investigate a drug traffic operation, they arrest the gang of the drug dealer Tony Salvano but they find that they are smuggling the plastic explosive C4 instead. However there is an interference of the FBI and Salvano and his partner are released by FBI Agent Neeley (Nicholas Kusenko) and the detectives are forbidden of proceed with the investigation. But Nico does not stop and is suspended from the police force. But when there is an explosion in the church of his neighborhood and his friend and parish priest Joseph Gennaro is murdered, Nico chases Salvano and discovers a corruption ring that is planning to kill the American Senator Ernest Harrison that is investigating the involvement of the CIA with drug traffic.","Language":"English, Spanish, Assyrian Neo-Aramaic","Country":"USA","Awards":"1 nomination.","Poster":"https://m.media-amazon.com/images/M/MV5BNjkyY2EzZmMtOGFhYS00OWQyLWI0YmMtZGFmNzhkN2EzZDgyXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.0/10"},{"Source":"Rotten Tomatoes","Value":"53%"},{"Source":"Metacritic","Value":"45/100"}],"Metascore":"45","imdbRating":"6.0","imdbVotes":"28,497","imdbID":"tt0094602","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Warner Brothers/Seven Arts","Website":"N/A","Response":"True"}