{"Title":"Cocktail","Year":"1988","Rated":"R","Released":"29 Jul 1988","Runtime":"104 min","Genre":"Comedy, Drama, Romance","Director":"Roger Donaldson","Writer":"Heywood Gould (screenplay)","Actors":"Tom Cruise, Bryan Brown, Elisabeth Shue, Lisa Banes","Plot":"After leaving the Army, Brian Flanagan tries to get a marketing job in New York City. But without a college degree, this is not possible. He then decides to start studying for a business degree at the local City College and gets a part time job as a bartender. He realizes that it's not easy but his new boss Douglas Coughlin teaches him the secrets of the bar trade and they become the most famous bartenders in town. Both Brian and Doug want their own top class cocktail bars someday and Brian's Cocktail Bar is to be called 'Cocktails and Dreams'. In order to get the necessary money to open it, Brian travels to Jamaica to work as a bartender at a resort Tiki Bar, and the pay is good. There he meets Jordan Mooney, a young and pretty, up and coming American artist on vacation with her girlfriend from New York City, staying at the Island resort. Jordan and Brian spend some quality time together and fall in love. But Brian takes a dare from his old buddy, Doug Coughlin to sleep with an older, wealthy woman, who is also staying at the resort. Jordan, herself the daughter of wealthy parents back in New York City, leaves the Island overnight, after seeing Brian and the older woman together after closing - Will Jordan ever forgive Brian and will they get back together?","Language":"English, Spanish Sign Language","Country":"USA, Canada","Awards":"Nominated for 1 Golden Globe. Another 5 wins & 5 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BY2Q0MjFlMTgtOWM1Ny00Y2FiLWI1NDItZDVmMmY5YTdlOGJmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.9/10"},{"Source":"Rotten Tomatoes","Value":"7%"},{"Source":"Metacritic","Value":"12/100"}],"Metascore":"12","imdbRating":"5.9","imdbVotes":"78,513","imdbID":"tt0094889","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Touchstone Pictures, Interscope Communications","Website":"N/A","Response":"True"}