{"Title":"Blue Steel","Year":"1990","Rated":"R","Released":"16 Mar 1990","Runtime":"102 min","Genre":"Action, Crime, Drama, Thriller","Director":"Kathryn Bigelow","Writer":"Kathryn Bigelow, Eric Red","Actors":"Jamie Lee Curtis, Ron Silver, Clancy Brown, Elizabeth Peña","Plot":"On her first day on the job, NYPD officer Megan Turner, the lone officer on the scene, shoots and kills the perpetrator of a supermarket hold-up. Since no gun was found on the perpetrator's person or at the scene and none of the witnesses could corroborate Megan's story definitively that the perpetrator was indeed wielding a gun, she is suspended from active duty. She is quickly albeit temporarily reinstated to the position of homicide detective because the spent shell casing from the bullet used in a subsequent murder had her name carved on it. This murder ends up being only the first in a series. Working on the case with fellow homicide detective Nick Mann, Megan initially has no idea who in her life could be the murderer. In short order, the murderer does show himself to her. He is commodities trader Eugene Hunt who she met immediately following her suspension and who she has since dated. He also implies to her that he was in the supermarket at the time of the hold-up and that he fled the scene with the perpetrator's gun. The supermarket shooting caused a psychotic break in him which resulted in among other things his obsession with her. However, beyond his implications only to her of being the murderer, Megan has no hard evidence that would stand up in a court of law that Eugene is indeed the murderer. Megan has to convince her colleagues, especially Nick, that she is telling the truth about Eugene, while stopping him from killing again and equally as important stopping him from his continued psychological torture of her.","Language":"English","Country":"USA","Awards":"2 wins & 1 nomination.","Poster":"https://m.media-amazon.com/images/M/MV5BZDQ5MjgxNGQtZWM0ZC00ZGJkLWFhYWQtNzAxZTQwMDcyNTQxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.7/10"},{"Source":"Rotten Tomatoes","Value":"75%"},{"Source":"Metacritic","Value":"54/100"}],"Metascore":"54","imdbRating":"5.7","imdbVotes":"12,073","imdbID":"tt0099160","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Vestron Pictures, Lightning Pictures","Website":"N/A","Response":"True"}