{"Title":"Impromptu","Year":"1991","Rated":"PG-13","Released":"01 May 1991","Runtime":"107 min","Genre":"Biography, Comedy, Music, Romance","Director":"James Lapine","Writer":"Sarah Kernochan","Actors":"Judy Davis, Hugh Grant, Mandy Patinkin, Bernadette Peters","Plot":"1830s Paris. Novelist George Sand, who is known to be writing her memoirs, is causing a sensation in the literary scene not only for the quality of her writing, but because of her extreme views and manners, including blurring the lines between the sexes - she generally wearing men's clothes - and her non-belief in the sanctity of marriage after having gone through the institution once before, now preferring sexual liaisons outside of her own wedlock, with the marital status of her lovers of no concern to her. She is just coming to the end of a turbulent affair with Félicien Mallefille, who she is now trying to avoid in his continual pursuit of her. Despite thinking it will be a bore because of their insufferable hostess, she invites herself to a weekend gathering of some of France's greatest artistic and creative minds - many who are attending solely for a weekend of free food - at the country estate of the Duke and Duchess D'Antan in Angers. George's want to attend is largely to get away from Mallefille, but also to meet visiting Polish composer Frédéric Chopin, who is an acquaintance of her cohabiting friends, Hungarian pianist Franz Liszt and Countess Marie D'Agoult. Marie largely acts as George's confidante. George has fallen in love with Chopin through his music, not even yet having met the man himself. George spends the weekend and beyond pursuing the sensitive and somewhat sickly Chopin, her conquest of him which may be difficult due to their fundamental differences. That conquest is made even more difficult by other guests of the Duke and Duchess: Mallefille; writer Alfred de Musset, another of George's former lovers; two hellions also known as her adolescent children, onto who she has passed her relaxed views of the world; and Marie, who George does not know wants to have a sexual liaison with Chopin herself behind Liszt's back.","Language":"English","Country":"USA, UK, France","Awards":"1 win & 1 nomination.","Poster":"https://m.media-amazon.com/images/M/MV5BZmM0ZTAyNmUtZjgxNi00NTEwLWE1MjEtMDBjYzY3MTUyNDdmXkEyXkFqcGdeQXVyODU2MDg1NzU@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.9/10"},{"Source":"Rotten Tomatoes","Value":"76%"}],"Metascore":"N/A","imdbRating":"6.9","imdbVotes":"4,641","imdbID":"tt0102103","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Les Films Ariane","Website":"N/A","Response":"True"}