{"Title":"Blue Sky","Year":"1994","Rated":"PG-13","Released":"16 Sep 1994","Runtime":"101 min","Genre":"Drama, Romance","Director":"Tony Richardson","Writer":"Rama Laurie Stagner (screenplay), Arlene Sarner (screenplay), Jerry Leichtling (screenplay), Rama Laurie Stagner (story)","Actors":"Jessica Lange, Tommy Lee Jones, Powers Boothe, Carrie Snodgress","Plot":"It's the early 1960s. Nuclear engineer Hank Marshall is a major in the US Army, he who works on top secret nuclear testing projects. Trouble follows him from posting to posting largely because of his mentally unstable wife, Carly Marshall, who is bipolar. During her manic phases, her already overt sexuality, which she models after such sex symbols as Marilyn Monroe and Brigitte Bardot, is ratcheted up a notch, that partying behavior which is mixed with less frequent phases of physically destructive behavior. Regardless, Hank and Carly love each other, Hank who would admit to himself that he enjoys the fact that other men find Carly attractive, which is partly why he allows her to act the way she does in public. In turn, they mutually love their now two teenaged daughters, Alex and Becky. Reassigned from their two year posting in Hawaii largely due to the ruckus Carly has caused there, they are next sent to Alabama, the base under the command of Vince Johnson, his wife, Vera Johnson, who heads the wives' welcoming committee. At an age of starting to test her own sexuality, Alex starts to date the Johnsons' son, Glenn. Due to no fault of his own, Hank faces some problems in the latest project on which he is working, code named Blue Sky. And Carly continues her regular behavior, which catches Vince's overtly wandering eye. These items in combination lead to the potential of the Marshalls' home life being pulled apart and Hank's career destroyed, both irreparably.","Language":"English, French","Country":"USA","Awards":"Won 1 Oscar. Another 3 wins & 5 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BNTQ1NTA3MTU5Ml5BMl5BanBnXkFtZTcwMzc3NDcyNA@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.4/10"},{"Source":"Rotten Tomatoes","Value":"79%"}],"Metascore":"N/A","imdbRating":"6.4","imdbVotes":"6,644","imdbID":"tt0109306","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Orion Pictures","Website":"N/A","Response":"True"}