{"Title":"Asterix in America","Year":"1994","Rated":"N/A","Released":"22 Sep 1995","Runtime":"85 min","Genre":"Animation, Adventure, Comedy, Family, Fantasy, Western","Director":"Gerhard Hahn","Writer":"René Goscinny (comic book \"La grande traversée\"), Albert Uderzo (comic book \"La grande traversée\"), Albert Uderzo (story), Pierre Tchernia (story), Thomas Platt (screenplay), Gerhard Hahn (screenplay), Robin Lyons (dialogue: English version), Andrew Offiler (dialogue: English version), Bill Speers (additional dialogue: English version)","Actors":"Roger Carel, Pierre Tornade, Henri Labussière, François Chaix","Plot":"Caesar has had enough when another legion is hacked to pieces by the damned single indomitable village in Gaul because of the druid's magic potion, so he decides to tackle the problem at the root before conspiratorial senators exploit his humiliation: sycophant Lucullus is ordered to capture the druid (believed immortal) and push him over the edge of the earth (according to the story still believed to be flat as a pizza; actually Greeks and Romans knew better). By pure luck, Lucullus' first net traps both druid and Obelix's pet dog, so the giant and Asterix follow them by ship on the Atlantic, and crash after a storm on the North America coast in pursuit of the druid who was catapulted off the Roman galley before Lucullus triumphantly sets sails back for Europe. They find the druid and meet a tribe of Indians (believing to be in India), literally a whole New World for the equally primitive Celts. At the home front, Caesar sees his chance to overrun the village, but has to wait till the last magic potion has run out, hoping the heroes won't return. In America, the medicine man has a bad eye in the foreigners, especially when the druid proves a dangerous rival...","Language":"English, French, German","Country":"Germany, France, Spain","Awards":"N/A","Poster":"https://m.media-amazon.com/images/M/MV5BOTJjOGJjYzYtMDEzNy00YWY5LWI1OWQtMzBlYmRlYTgwNjljXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.0/10"},{"Source":"Rotten Tomatoes","Value":"35%"}],"Metascore":"N/A","imdbRating":"6.0","imdbVotes":"6,884","imdbID":"tt0109162","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"N/A","Website":"N/A","Response":"True"}