{"Title":"Safe","Year":"1995","Rated":"R","Released":"30 Jun 1995","Runtime":"119 min","Genre":"Drama","Director":"Todd Haynes","Writer":"Todd Haynes","Actors":"Julianne Moore, Xander Berkeley, Dean Norris, Julie Burgess","Plot":"\"Safe\" has been described as a horror movie of the soul, a description that director Todd Haynes relishes. California housewife Carol White seems to have it all in life: a wealthy husband, a beautiful house, servants, beauty, and a lot of friends. The only thing she lacks is a strong personality: Carol seems timid and empty during all of her interactions with the world around her. At the beginning of the film, one would consider her to be more safe in life than just about anyone. That doesn't turn out to be the case. Starting with headaches and leading to a grandmal seizure, Carol becomes more and more sick, claiming that she's become sensitive to the common toxins in today's world: exhaust, fumes, aerosol spray, etc. She pulls back from the sexual advances of her husband and spends her nights alone by the TV or wandering around the outside of her well-protected home like an animal in a cage. Her physician examines her and can find nothing wrong. An allergist finds that she has an allergic reaction to milk but explains that there is no treatment for that sort of allergy. She sees a psychiatrist who does nothing but make her nervous. In the hospital, Carol sees an infomercial for Wrenwood, a new-age retreat for those who are \"environmentally ill,\" and leaves her husband and stepson to try and find salvation at this retreat: headed by a phony, grandstanding, \"sensitive\" individual named Peter Dunning.","Language":"English, Spanish","Country":"UK, USA","Awards":"4 wins & 12 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BODliOWEzMTUtZDQ5ZS00ZTBmLTgzNzEtMGVkOTlhYWNkYjE2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.2/10"},{"Source":"Rotten Tomatoes","Value":"86%"},{"Source":"Metacritic","Value":"76/100"}],"Metascore":"76","imdbRating":"7.2","imdbVotes":"13,099","imdbID":"tt0114323","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Good Machine, American Playhouse","Website":"N/A","Response":"True"}