{"Title":"The Boxer","Year":"1997","Rated":"R","Released":"09 Jan 1998","Runtime":"113 min","Genre":"Drama, Romance, Sport","Director":"Jim Sheridan","Writer":"Jim Sheridan, Terry George","Actors":"Daniel Day-Lewis, Daragh Donnelly, Frank Coughlan, Sean Kearns","Plot":"Nineteen-year-old Danny Flynn is imprisoned for his involvement with the I.R.A. in Belfast. He leaves behind his family and his sixteen-year-old girlfriend, Maggie Hamill. Fourteen years later, Danny is released from prison and returns to his old working class neighborhood to resume his life as a boxer, fighting and opening a boxing club training aspiring boxers. Maggie has since married Danny's best friend, who is also imprisoned for his I.R.A. activities. Although he has not denounced the I.R.A. or denigrated his I.R.A. colleagues, Danny has decided to live a life free of political violence. His boxing club is nonsectarian, open to both Catholics and Protestants. This move irks some of his old I.R.A. colleagues since they feel working with the Protestants will not resolve their David versus Goliath struggle. Danny's old I.R.A. colleagues, especially their unofficial leader Harry, resort to traditional tactics of violence to stop Danny. Maggie's father, Joe, also an I.R.A. activist, does not condone the violence against Danny as he is working through peaceful means to free I.R.A. prisoners (including Maggie's husband), but also does not want Maggie to resume her past relationship with Danny, a man who he sees as having no future. Amidst this turmoil, Danny and Maggie dream of a life together, also taking into account Maggie's wedded status and the feelings of her teen-aged son, Liam. [Originally by: Huggo]","Language":"English","Country":"USA, Ireland","Awards":"Nominated for 3 Golden Globes. Another 3 wins & 3 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BZjgxZmFkMTktMWYzYi00ZjdhLWJiODEtNTcyODIwNjQxZGQzXkEyXkFqcGdeQXVyNzQ5MzY0NjM@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.0/10"},{"Source":"Rotten Tomatoes","Value":"80%"},{"Source":"Metacritic","Value":"75/100"}],"Metascore":"75","imdbRating":"7.0","imdbVotes":"18,728","imdbID":"tt0118760","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Universal Pictures, Hell&#39;s Kitchen Films","Website":"N/A","Response":"True"}