{"Title":"Heavy Metal 2000","Year":"2000","Rated":"R","Released":"10 Jul 2000","Runtime":"88 min","Genre":"Animation, Action, Adventure, Fantasy, Sci-Fi","Director":"Michael Coldewey, Michel Lemire","Writer":"Simon Bisley (graphic novel \"The Melting Pot\"), R. Payne Cabeen, Kevin Eastman (comic books \"Melting Pot\"), Kevin Eastman (screenplay), Robert Geoffrion (additional), Carl Macek, John Minnis (additional), Lorenzo Orzari (additional), Eric Talbot (graphic novel \"The Melting Pot\"), George Ungar (additional)","Actors":"Michael Ironside, Julie Strain, Billy Idol, Pier Paquette","Plot":"In ages past, a malevolent race called the Arakacians discovered a place where space-time leaked an immortality water. The Arakacians conquered the known universe for centuries, and were finally vanquished after the fountain chamber was sealed by freedom fighters. Upon discovery of a shard of the Loc-Nar (the evil orb from the original movie), a miner named Tyler becomes possessed by an insatiable hunger for power and a thirst for immortality. On his way to a planet which has the immortality fountain, Tyler makes a brief stop on F.A.K.K.² (Federation-Assigned Ketogenic Killzone) because its inhabitants carry some immortality water in their bodies. Tyler invades the space colony, wipes out most of the inhabitants, and kidnaps a beautiful woman named Kerrie. Enraged by Tyler's careless rampage, Kerrie's beautiful sister Julie vows to avenge her family and wipe out Tyler before he reaches the fountain.","Language":"English","Country":"Canada, Germany","Awards":"1 nomination.","Poster":"https://m.media-amazon.com/images/M/MV5BMTMzMDM0MjI0NV5BMl5BanBnXkFtZTYwODE5MDc5._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.5/10"},{"Source":"Rotten Tomatoes","Value":"10%"}],"Metascore":"N/A","imdbRating":"5.5","imdbVotes":"7,631","imdbID":"tt0119273","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Das Werk, Helkon Media AG, CineGroupe","Website":"N/A","Response":"True"}