{"Title":"Timecode","Year":"2000","Rated":"R","Released":"28 Apr 2000","Runtime":"97 min","Genre":"Drama, Romance","Director":"Mike Figgis","Writer":"Mike Figgis (story)","Actors":"Xander Berkeley, Golden Brooks, Saffron Burrows, Viveka Davis","Plot":"The primary story with this movie is that it is shown in four simultaneously filmed ninety-three minute single shot takes (in other words, shown in four quadrants), with the actual plot secondary. The four cameras follow the players involved, with two or more of the four cameras sometimes filming the exact same scene from different angles and thus different perspectives. The audio on each of the four quadrants is turned up and down based on which quadrant(s) the viewer should pay most attention to at any given time. The actual plot, which takes place in Hollywood, involves the pre-production by Red Mullet Productions for the movie \"Bitch from Louisiana\". The production team is in an executive meeting to discuss several aspects of the movie, including problems with one of their own, Alex Green, who has been missing in action from much of the production and this meeting. Alex's problems stem from his substance abuse and philandering, his wife Emma who is contemplating leaving him, of which he is unaware. Lester Moore, the movie's director, is also causing the producers some concern as they believe he again is using drugs against company policy. The production team is also talking about casting the role of \"The Bitch\". One actress who wants to audition is Rose, who is having an affair with Alex as a foot in the door. Rose does not officially have an audition, although she tells her controlling lover, Lauren, that's why she is going to Red Mullet's office, while she really is meeting with Alex for a tryst. Lauren, however, believes that Rose is indeed cheating on her. Through it all, Quentin, a masseuse, is present giving free massages as a means to gain Red Mullet as a corporate client. Their goings-on come to a head during a pitch meeting by visiting European actress, Ana Pauls, who is accompanied by her agent, Bunny Drysdale, and her musician boyfriend, Joey Z.","Language":"English","Country":"USA","Awards":"2 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BMTcxNzQ5ODA5Ml5BMl5BanBnXkFtZTYwMzA3ODg2._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.0/10"},{"Source":"Rotten Tomatoes","Value":"68%"},{"Source":"Metacritic","Value":"65/100"}],"Metascore":"65","imdbRating":"6.0","imdbVotes":"6,418","imdbID":"tt0220100","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Red Mullet Productions","Website":"N/A","Response":"True"}