{"Title":"Tortilla Soup","Year":"2001","Rated":"PG-13","Released":"31 Aug 2001","Runtime":"102 min","Genre":"Comedy, Romance, Drama","Director":"Maria Ripoll","Writer":"Hui-Ling Wang (earlier screenplay), Ang Lee (earlier screenplay), James Schamus (earlier screenplay), Ramón Menéndez (screenplay), Tom Musca (screenplay), Vera Blasi (screenplay)","Actors":"Jacqueline Obradors, Tamara Mello, Judy Herrera, Nikolai Kinski","Plot":"Retired Mexican-American chef Martin Naranjo shares an L.A. home with his three gorgeous, but single, adult daughters. Though he long ago lost his ability to taste, Martin still lives to cook incredibly lavish dinners for his loved ones and to serve them in a family-style ritual at traditional sit-down meals. Although the women humor their father's old-fashioned ways, each of them is searching for fulfillment outside the family circle. College student Maribel is growing increasingly frustrated with the singles scene and wants a steady man; gorgeous career woman Carmen is fed up with her boyfriend and his wandering eye; meanwhile, eldest daughter Letitia, who has suppressed her own romantic longings, senses something missing in her life. Things take a turn for the romantic when Dad, a widower, meets a vivacious divorcee on the lookout for a mate and each of his daughters, in turn, finds someone. But they'll all discover that the recipe for happiness may call for some unexpected ingredients.","Language":"English, Spanish","Country":"USA","Awards":"2 wins & 7 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BZGJhMmZkOWYtZDI5MC00ODM3LTg5N2ItODhiMDk3NDM0YWUwXkEyXkFqcGdeQXVyMjE4NzUxNDA@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.7/10"},{"Source":"Rotten Tomatoes","Value":"74%"},{"Source":"Metacritic","Value":"58/100"}],"Metascore":"58","imdbRating":"6.7","imdbVotes":"4,289","imdbID":"tt0255653","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Samuel Goldwyn Films, Starz! Encore Entertainment","Website":"N/A","Response":"True"}