{"Title":"Strangers with Candy","Year":"2005","Rated":"R","Released":"21 Jul 2006","Runtime":"97 min","Genre":"Comedy","Director":"Paul Dinello","Writer":"Stephen Colbert (series Strangers with Candy), Paul Dinello (series Strangers with Candy), Amy Sedaris (series Strangers with Candy), Mitch Rouse (series Strangers with Candy), Stephen Colbert, Paul Dinello, Amy Sedaris","Actors":"Amy Sedaris, Paul Sedaris, Chandra Wilson, Kristy Thomas","Plot":"Forty-seven-year-old Jerri Blank is a socially unaware ex-con junkie alcoholic prostitute. After being released from her latest stint behind bars, Jerri wants to clean up her life and decides the best way to do so is to go home, where she left thirty-two years earlier when she began her depraved life. She arrives home to find that her mother has died, and her father has remarried a much younger woman and has fallen into a stress-induced coma in part because she disappeared. She takes that cleaning up her life one step further when Dr. Putney, her father's doctor, tells her that he may emerge from his coma if life were to return to the way it was before she left, but better, as she has to make her father proud. So she decides to go back to her old high school, Flatpoint, to get her high school diploma. She quickly decides the best way to be the best student possible is to participate in and win the state science fair. In her quest, she gets caught up in the competing agendas of: Principal Onyx Blackman, who needs a winning science fair team so as not to have to return discretionary school board funding, which he obtained through fraud and which he has since misappropriated; science teacher Chuck Noblet, a married born-again Christian closet homosexual who tries quietly or not so quietly to win back the affections of his lover, Geoffrey Jellineck, the sensitive art teacher; and Roger Beekman, the winning teacher of the past nine science fairs whom Blackman brings into Flatpoint as a ringer, much to Noblet's chagrin. Jerri also has to keep her focus on the end goal of her father, which may not be easy to do for a socially unaware middle-aged libidinous junkie prostitute who wants to be one of the popular kids, and do it with the big man and the innocent virginal girl on campus.","Language":"English","Country":"USA","Awards":"N/A","Poster":"https://m.media-amazon.com/images/M/MV5BMTgwMTM0MzgyNF5BMl5BanBnXkFtZTcwMjg4MzMzMQ@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.0/10"},{"Source":"Rotten Tomatoes","Value":"52%"},{"Source":"Metacritic","Value":"57/100"}],"Metascore":"57","imdbRating":"6.0","imdbVotes":"7,661","imdbID":"tt0369994","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Silverstar Productions, Worldwide Pants Inc., Roberts/David Films Inc.","Website":"N/A","Response":"True"}