{"Title":"El Crimen Perfecto (The Perfect Crime)","Year":"2004","Rated":"Not Rated","Released":"22 Oct 2004","Runtime":"105 min","Genre":"Comedy, Crime, Thriller","Director":"Álex de la Iglesia","Writer":"Jorge Guerricaechevarría (screenplay), Álex de la Iglesia (screenplay)","Actors":"Guillermo Toledo, Mónica Cervera, Luis Varela, Enrique Villén","Plot":"An impending much-sought-after promotion at Yeyo's shopping mall in Madrid has created quite a stir, as a new floor supervisor needs to be chosen between Don Antonio, the helpful, experienced, yet, stern and gloomy head of the men's department and Rafael, the seductive, highly skilled salesman and head of the women's department. Without a doubt, competition is hard when there's only room for one, however, when the suave and sophisticated Rafael loses out to his inelegant arch nemesis, he will find himself in a very tight spot when during an argument, he will accidentally kill Don Antonio. Obviously, with him as a prime suspect, handsome Rafael is in dire straits and desperate as he is, he will inevitably accept help from Lourdes, the department's ugly duckling who unfortunately knows all about his misfortune, nevertheless, not without a cost. With his life literally in Lourdes' hands, blackmailed into her preposterous demands, there is only one way out and Rafael will need to stain his hands with blood once more, but shortly, he will learn that there is no such thing as the ferpect crime.","Language":"Spanish","Country":"Spain, Italy","Awards":"4 wins & 13 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BZjVmOTczZTgtYjlkNi00ZDdmLTk4ZjctMTNlODhiMmUyODM1XkEyXkFqcGdeQXVyMzg2MzE2OTE@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.1/10"},{"Source":"Rotten Tomatoes","Value":"85%"},{"Source":"Metacritic","Value":"68/100"}],"Metascore":"68","imdbRating":"7.1","imdbVotes":"11,234","imdbID":"tt0395125","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Sogecine","Website":"N/A","Response":"True"}