{"Title":"Looking for Comedy in the Muslim World","Year":"2005","Rated":"PG-13","Released":"20 Jan 2006","Runtime":"98 min","Genre":"Comedy","Director":"Albert Brooks","Writer":"Albert Brooks","Actors":"Penny Marshall, Victoria Burrows, Paul Jerome, Albert Brooks","Plot":"The American senate, in order to improve it's fast declining global image, asks comedian Albert Brooks to write a 500 page document about what makes Muslims laugh in India and Pakistan. Bidding adieu to his wife and young daughter,and accompanied by two government bureaucrats, Albert opens up an office in New Delhi, hires a pretty Secretary, Maya, and goes around asking people at random as to what makes them laugh. He finds that people generally look at him suspiciously and refuse to answer any questions. He then decides to go public and stage a comedy show, the suggested place for the publicity is old Delhi. Accordingly the four re-locate, book a school auditorium to seat about 400 people, go around the city distributing leaflets, inviting the general public to attend the show. They get a houseful response, however, Albert's comedy act fails to impress. He then decides to try his hand in Pakistan, only to be told that he cannot get a visa for another 14 days. He decides to enter Pakistan illegally and meets some wannabe comedians, guarded by armed men, in a secret location near the border. Although he does get to their funny bones, Albert does not get any answers, and returns back to Delhi crestfallen. To make matters worse, Maya informs him that she has enough material to write about 4 pages. Quite unknown to Albert, his presence in India, and his underground trip to Pakistan, have not gone unnoticed by both the Indian and Pakistani governments, both of who plan to increase their troop presence near the volatile border area; and to create more complications for Albert, Maya tells him that she wants to break up with his boyfriend. She wants to him to leave, and thinks that he may do so if told that she is fallen for Albert. Then things start looking up for Albert when he is invited by the Al-Jazeera television for an interview. Watch as events unfold and a hopeful Albert attends this meeting with many hopes of entering the Muslim world through this popular TV network.","Language":"Arabic, Hindi, English","Country":"USA","Awards":"N/A","Poster":"https://m.media-amazon.com/images/M/MV5BMTg0MjM2NzI2OF5BMl5BanBnXkFtZTcwOTgwODYzMQ@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.4/10"},{"Source":"Rotten Tomatoes","Value":"42%"},{"Source":"Metacritic","Value":"53/100"}],"Metascore":"53","imdbRating":"5.4","imdbVotes":"3,141","imdbID":"tt0433116","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Seventh Picture Productions LLC, Shangri-La Entertainment","Website":"N/A","Response":"True"}