{"Title":"New York, I Love You","Year":"2008","Rated":"R","Released":"16 Oct 2009","Runtime":"103 min","Genre":"Comedy, Drama, Romance","Director":"Fatih Akin, Yvan Attal, Randall Balsmeyer, Allen Hughes, Shunji Iwai, Wen Jiang, Shekhar Kapur, Joshua Marston, Mira Nair, Natalie Portman, Brett Ratner","Writer":"Hu Hong (segment), Yao Meng (segment), Israel Horovitz (adaptation), Suketu Mehta (segment), Shunji Iwai (segment), Israel Horovitz (adaptation), Olivier Lécot (segment), Jeff Nathanson (segment), Xan Cassavetes (segment), Stephen Winter (segment), Anthony Minghella (segment), Natalie Portman (segment), Fatih Akin (segment), Joshua Marston (segment), Hall Powell (transitions \"Randy Balsmeyer\"), Israel Horovitz (transitions \"Randy Balsmeyer\"), Jim Strouse (transitions \"Randy Balsmeyer\"), Emmanuel Benbihy (concept)","Actors":"Hayden Christensen, Andy Garcia, Rachel Bilson, Natalie Portman","Plot":"Eleven vignettes, all homages to New York City life, are presented. I. Ben, a pickpocket, is attracted to Molly on first sight, and gets into an interesting \"pissing match\" with Molly's married lover, NYU professor Garry. II. Mansuhkhbai, an orthodox Jain diamond wholesaler, and Rifka, an orthodox Jewish diamond retailer who is getting married tomorrow, learn that they have more in common than just diamonds. III. David, a musician and music editor for a video being directed by Abarra, is having problems meeting Abarra's demands while he slowly falls for Abarra's assistant, Camille, who he's never met but has only talked to on the telephone solely about work. IV. A young man believes he's made a powerful connection to a stranger, a young woman, in the simple act of lighting her cigarette, and proceeds to convince her of the same and as such that there is a future for them from that point on, and not at some unspecified time down the road. V. A high school senior, who has been dumped by his girlfriend just before senior prom, is given a gift by his local pharmacist, Mr. Riccoli, the senior not understanding the full implication of the gift until the full process of prom night is over. VI. Each on their way to their first official date together after what started out solely as a one night stand, Gus and Lydia each contemplate not keeping the date. VII. Isabelle, a retired opera diva, has returned to a hotel where she's stayed many times and where she has strong memories of encounters with a young bellhop. VIII. In brown skinned Dante and white skinned young adolescent Teya spending time together in a park, most outsiders see a manny and his charge, not realizing the true nature of Dante and Teya's relationship. IX. In questioning why one of her elderly Eastern European customers chose her as the wanted subject for his next painting, a young Chinese herbalist may be inspired to create some art of her own. X. Anna, who meets Alex by chance on the street each going about their individual business, asks him a question, she having an ulterior motive while expecting a totally different reaction from him contrary to her motive... maybe. XI. Abe and Mitzie are spending their 63rd wedding anniversary together, not always harmoniously. Interspersed between these eleven vignettes are even shorter ones, often tying together to another or to one of the eleven primary ones in some manner.","Language":"English, French, Cantonese, Gujarati, Yiddish","Country":"USA, Bahrain","Awards":"1 nomination.","Poster":"https://m.media-amazon.com/images/M/MV5BMTI3NDYxOTM4OF5BMl5BanBnXkFtZTcwOTEwNTI4Mg@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.2/10"},{"Source":"Rotten Tomatoes","Value":"37%"},{"Source":"Metacritic","Value":"49/100"}],"Metascore":"49","imdbRating":"6.2","imdbVotes":"44,472","imdbID":"tt0808399","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Rose Pictures, Sherazade Film Development, Plum Pictures, 2008NY5, Ever So Close, Benaroya Pictures, Vivendi Entertainment, Also Known As Pictures, Grand Army Entertainment, Visitor Pictures, Grosvenor Park Productions","Website":"N/A","Response":"True"}