{"Title":"Encounters at the End of the World","Year":"2007","Rated":"G","Released":"18 Jul 2008","Runtime":"99 min","Genre":"Documentary","Director":"Werner Herzog","Writer":"Werner Herzog","Actors":"Werner Herzog, Scott Rowland, Stefan Pashov, Doug MacAyeal","Plot":"'Werner Herzog' takes his camera to Antarctica where we meet the odd men and women who have dedicated their lives to furthering the cause of science in treacherous conditions. A scientist studies neutrinos, which are everywhere, yet elusive; he likens them to spirits. A researcher's nighttime performance art includes contorting her body into a luggage bag. A survival guide teaches his students to survive white-out conditions by wearing cartoon-face buckets over their heads. Animal researchers milk mother seals as part of their study. Volcanologists offer advice on what to do when a volcano erupts. A pipefitter shows us the anomaly in his hands that he says are a sign he descended from Atzec royalty. A former Colorado banker drives what he has christened Ivan the Terra Bus. An underwater diver shows his colleagues DVDs of apocalyptic sci-fi films like Them! (1954). And -- though Herzog declares he's not \"making another film about penguins\" -- we meet a penguin researcher who answers the filmmaker's questions about homosexuality and insanity in his subjects. We also meet an individualist penguin, who breaks away from the other birds to run toward the mountains, facing certain death.","Language":"English, Spanish","Country":"USA","Awards":"Nominated for 1 Oscar. Another 2 wins & 15 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BOTI3NjkyNjY2OV5BMl5BanBnXkFtZTcwOTUwMTU3MQ@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.7/10"},{"Source":"Rotten Tomatoes","Value":"94%"},{"Source":"Metacritic","Value":"80/100"}],"Metascore":"80","imdbRating":"7.7","imdbVotes":"17,034","imdbID":"tt1093824","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Creative Differences, Discovery Films","Website":"N/A","Response":"True"}