{"Title":"Batman: Gotham Knight","Year":"2008","Rated":"PG-13","Released":"08 Jul 2008","Runtime":"75 min","Genre":"Animation, Action, Crime, Sci-Fi, Thriller","Director":"Yasuhiro Aoki, Futoshi Higashide, Toshiyuki Kubooka, Hiroshi Morioka, Jong-Sik Nam, Shôjirô Nishimi, Yûichirô Hayashi(co-director)","Writer":"Bob Kane (creator: Batman), Jordan Goldberg (story), Josh Olson (screenplay), Jordan Goldberg (story), Greg Rucka (screenplay), Jordan Goldberg (story), Jordan Goldberg (screenplay), Jordan Goldberg (story), David S. Goyer (screenplay), Jordan Goldberg (story), Brian Azzarello (screenplay), Jordan Goldberg (story), Alan Burnett (screenplay)","Actors":"Kevin Conroy, Jason Marsden, Scott Menville, George Newbern","Plot":"In this 6-story anthology collection, Batman faces new villains and old ones in a time-line after Batman Begins. In \"Have I Got A Story For You\", 3 kids tell wildly different stories about Batman during a fight through Gotham. \"Crossfire\" focuses on two policemen who end up getting in the middle of a crime battle. \"Field Test\" has Lucius Fox creating a new technology for Batman, but is it too powerful? \"In Darkness Dwells\" features Killer Croc and Scarecrow, who have kidnapped a priest. \"Working Through Pain\" goes through flashbacks of Bruce Wayne's training while Batman finds his way through the sewers. Finally, \"Deadshot\" focuses on the titular sniper, who has a new target in Gotham.","Language":"English, Japanese, Spanish, Portuguese, Thai","Country":"USA, Japan, South Korea","Awards":"1 win & 2 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BM2I0YTFjOTUtMWYzNC00ZTgyLTk2NWEtMmE3N2VlYjEwN2JlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.8/10"},{"Source":"Rotten Tomatoes","Value":"86%"}],"Metascore":"N/A","imdbRating":"6.8","imdbVotes":"26,075","imdbID":"tt1117563","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Warner Bros. Animation","Website":"N/A","Response":"True"}