{"Title":"A Prophet","Year":"2009","Rated":"R","Released":"26 Mar 2010","Runtime":"155 min","Genre":"Crime, Drama","Director":"Jacques Audiard","Writer":"Thomas Bidegain (screenplay), Jacques Audiard (screenplay), Abdel Raouf Dafri (original screenplay), Nicolas Peufaillit (original screenplay)","Actors":"Tahar Rahim, Niels Arestrup, Adel Bencherif, Reda Kateb","Plot":"Nineteen year-old Franco-Arab Malik El Djebena is just starting his six year prison sentence in Brécourt. Although he has spent the better part of his life in juvenile detention, this stint is his first in an adult prison. Beyond the division of Corsicans and Muslims in the prison (the Corsicans who with their guard connections rule what happens in the prison), he has no known friends or enemies inside. He is just hoping to serve his time in peace and without incident, despite having no prospects once he's out of jail since he's illiterate and has no support outside of the prison. Due to logistics, the head of Corsican inmates, a sadistic mafioso named César Luciani, co-opts Malik as part of the Corsicans' activities, not only regarding what happens inside the prison, but also continued criminal activities outside. The innocent Malik has no idea what to do but cooperate. This move does not sit well with the other Corsicans, who only see Malik as a dirty Arab, and the Muslims who now mistrust him. But as time goes on, Malik works to save himself while in prison, while setting up his life post prison on his own terms. Both his demon and his salvation in prison is the specter of one of the first people he really got to know during his incarceration.","Language":"French, Arabic, Corsican","Country":"France, Italy","Awards":"Nominated for 1 Oscar. Another 52 wins & 54 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BMTUyMjQ1MTY5OV5BMl5BanBnXkFtZTcwNzY5NjExMw@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.9/10"},{"Source":"Rotten Tomatoes","Value":"97%"},{"Source":"Metacritic","Value":"90/100"}],"Metascore":"90","imdbRating":"7.9","imdbVotes":"92,778","imdbID":"tt1235166","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Chic Films, Région Ile-de-France, Conseil Régional de Provence-Alpes Côte d&#39;Azur, BIM Distribuzione, Canal+, Neon Productions, Page 114, Sofica UGC 1, France 2 (FR2), Why Not Productions, Centre National de la Cinématographie (CNC), CinéCinéma, Sofica Soficinéma 4, Soficinéma 5, France 2 Cinéma, Zyzzyx LLC, Union Générale Cinématographique (UGC), Celluloid Dreams","Website":"N/A","Response":"True"}