{"Title":"Get the Gringo","Year":"2012","Rated":"R","Released":"22 Jun 2012","Runtime":"96 min","Genre":"Action, Crime, Drama","Director":"Adrian Grunberg","Writer":"Mel Gibson, Stacy Perskie, Adrian Grunberg","Actors":"Mel Gibson, Kevin Balmore, Daniel Giménez Cacho, Jesús Ochoa","Plot":"Heading toward the Mexican border, a getaway driver disguised as a clown and his wounded accomplice try to escape the American Police with a loot of over $2 million hidden in the trunk of the car. In a desperate attempt to break through the thick border fence, the driver crashes the car, the accomplice dies and he inevitably gets apprehended by Mexican Police officers Romero and Vasquez who want the money just for themselves. As the only American inmate in the infamous \"El Pueblito\" Mexican prison, which resembles more of a small village of convicts rather than a usual prison, the driver quickly gets the nickname \"The Gringo\" and finds out first hand how rough it is to be a stranger in the perilous world of Javi, the ruthless crime lord who runs the prison. Sooner or later, the Gringo will form an alliance with a 10-year-old kid whose peculiar immunity in this mad place will efficiently keep him alive, only to realise that in this pit, everyone knows about the $2 million. In the end, with an order issued for his execution and knowing that his time is short, will the Gringo manage to save himself and the kid's family, get his money and ultimately escape once and for all from the El Pueblito?","Language":"English, Spanish","Country":"USA, Mexico","Awards":"N/A","Poster":"https://m.media-amazon.com/images/M/MV5BY2I4ZDcxMDctZTkwZC00YWFmLTkxZDQtZGNkYTQ5YTlmZWI0XkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.0/10"},{"Source":"Rotten Tomatoes","Value":"82%"},{"Source":"Metacritic","Value":"60/100"}],"Metascore":"60","imdbRating":"7.0","imdbVotes":"102,720","imdbID":"tt1567609","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Icon Productions","Website":"N/A","Response":"True"}