{"Title":"Universal Soldier: Day of Reckoning","Year":"2012","Rated":"R","Released":"25 Oct 2012","Runtime":"114 min","Genre":"Action, Horror, Mystery, Sci-Fi, Thriller","Director":"John Hyams","Writer":"John Hyams (screenplay), Doug Magnuson (screenplay), Jon Greenhalgh (screenplay), John Hyams (story), Moshe Diamant (story), Richard Rothstein (based on characters created by), Christopher Leitch (based on characters created by)","Actors":"Jean-Claude Van Damme, Dolph Lundgren, Scott Adkins, Mariah Bonner","Plot":"John awakens from a coma to discover his wife and daughter were slaughtered in a brutal home invasion. Haunted by images of the attack, he vows to kill the man responsible: Luc Deveraux. While John tries to piece his reality back together, things get more complicated when he is pursued by a relentless UniSol named Magnus. Meanwhile, Deveraux and surviving UniSol Andrew Scott are preparing to battle anarchy and build a new order ruled by Unisols without government oversight. They are weeding out the weak and constantly testing their strongest warriors in brutal, life-and-death combat. Luc has emerged operating the Unisol Church of Eventualism, taking in wayward Unisols whom the government has been secretly operating as remote-controlled sleeper agents. His mission is to liberate these Unisols from the implanted memories and the lies the government has inserted in them. As John gets closer to Deveraux and the rogue army of genetically enhanced warriors, he discovers more about himself and begins to call into question everything he believed to be true.","Language":"English","Country":"USA","Awards":"N/A","Poster":"https://m.media-amazon.com/images/M/MV5BMTM3ODMxMDY0MF5BMl5BanBnXkFtZTcwNDc3MTY0OA@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.0/10"},{"Source":"Rotten Tomatoes","Value":"57%"},{"Source":"Metacritic","Value":"58/100"}],"Metascore":"58","imdbRating":"5.0","imdbVotes":"19,109","imdbID":"tt1659343","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Foresight Unlimited, Baumgarten, Signature Pictures","Website":"N/A","Response":"True"}