{"Title":"Mood Indigo","Year":"2013","Rated":"Not Rated","Released":"18 Jul 2014","Runtime":"94 min","Genre":"Comedy, Drama, Fantasy, Romance","Director":"Michel Gondry","Writer":"Michel Gondry (scenario), Luc Bossi (scenario), Boris Vian (novel)","Actors":"Romain Duris, Audrey Tautou, Gad Elmaleh, Omar Sy","Plot":"Set in a charmingly surreal Paris, wealthy bachelor Colin spends his time developing his pianocktail (a cocktail-making piano) and devouring otherworldly dishes prepared by his trusty chef Nicolas. When Colin learns that his best friend Chick, a fellow acolyte of the philosopher Jean-Sol Partre, has a new American girlfriend, our lonely hero attends a friend's party in hopes of falling in love himself. He soon meets Chloe and, before they know it, they're dancing to Duke Ellington and plunging headfirst into a romance. Their whirlwind courtship is tested when an unusual illness plagues Chloe; a flower begins to grow in her lungs. To save her, Colin discovers the only cure is to surround Chloe with a never-ending supply of fresh flowers.","Language":"French, English","Country":"France, Belgium","Awards":"1 win & 9 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BZGU2MDhiNjYtODJmNy00YzllLWJlZGItZTdiNmRiY2Q3MjBjXkEyXkFqcGdeQXVyNDgzNjg5Nw@@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.5/10"},{"Source":"Rotten Tomatoes","Value":"60%"},{"Source":"Metacritic","Value":"54/100"}],"Metascore":"54","imdbRating":"6.5","imdbVotes":"15,084","imdbID":"tt2027140","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"La Banque Postale Images 5, Angoa-Agicoa, Belgacom, Eurimages, StudioCanal, Procirep, Brio Films, Région Ile-de-France, Le Tax Shelter du Gouvernement Fédéral de Belgique, Centre National de la Cinématographie (CNC), Anton Capital Entertainment, Radio Télévision Belge Francophone, Scope Pictures, France Télévision, Sofica Manon 2, SCOPE Invest, Canal+, Ciné+, Cinémage 6, France 2 Cinéma, MEDIA Programme of the European Union, Cinémage 7, Hérodiade","Website":"N/A","Response":"True"}