{"Title":"Valerian and the City of a Thousand Planets","Year":"2017","Rated":"PG-13","Released":"21 Jul 2017","Runtime":"136 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Director":"Luc Besson","Writer":"Pierre Christin (based on the comic book series \"Valerian and Laureline\" by), Jean-Claude Mézières (based on the comic book series \"Valerian and Laureline\" by), Luc Besson (screenplay by)","Actors":"Dane DeHaan, Cara Delevingne, Clive Owen, Rihanna","Plot":"VALERIAN AND THE CITY OF A THOUSAND PLANETS is the new adventure film from Luc Besson, the director of The Professional, The Fifth Element and Lucy, based on the comic book series which inspired a generation of artists, writers and filmmakers. In the 28th century, Valerian (Dane DeHaan) and Laureline (Cara Delevingne) are a team of special operatives charged with maintaining order throughout the human territories. Under assignment from the Minister of Defense, the two embark on a mission to the astonishing city of Alpha-an ever-expanding metropolis where species from all over the universe have converged over centuries to share knowledge, intelligence and cultures with each other. There is a mystery at the center of Alpha, a dark force which threatens the peaceful existence of the City of a Thousand Planets, and Valerian and Laureline must race to identify the marauding menace and safeguard not just Alpha, but the future of the universe.","Language":"English, French","Country":"France, China, Belgium, Germany, United Arab Emirates, USA, Canada, New Zealand, Singapore, UK, Thailand","Awards":"11 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BMTkxMDAxNDUyNV5BMl5BanBnXkFtZTgwOTc3MzcxMjI@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.5/10"},{"Source":"Rotten Tomatoes","Value":"48%"},{"Source":"Metacritic","Value":"51/100"}],"Metascore":"51","imdbRating":"6.5","imdbVotes":"160,459","imdbID":"tt2239822","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Fundamental Films, STX Entertainment, EuropaCorp","Website":"N/A","Response":"True"}