{"Title":"Blue Is the Warmest Colour","Year":"2013","Rated":"NC-17","Released":"09 Oct 2013","Runtime":"180 min","Genre":"Drama, Romance","Director":"Abdellatif Kechiche","Writer":"Abdellatif Kechiche (scenario,  adaptation and dialogue), Ghalya Lacroix (scenario,  adaptation and dialogue), Julie Maroh (adapted from: the comic book \"Le Bleu est une couleur chaude\" by)","Actors":"Léa Seydoux, Adèle Exarchopoulos, Salim Kechiouche, Aurélien Recoing","Plot":"Adèle is a high school student who is beginning to explore herself as a woman. She dates men but finds no satisfaction with them sexually, and is rejected by a female friend who she does desire. She dreams of something more. She meets Emma who is a free spirited girl whom Adèle's friends reject due to her sexuality, and by association most begin to reject Adèle. Her relationship with Emma grows into more than just friends as she is the only person with whom she can express herself openly. Together, Adèle and Emma explore social acceptance, sexuality, and the emotional spectrum of their maturing relationship.","Language":"French, English","Country":"France, Belgium, Spain","Awards":"Nominated for 1 Golden Globe. Another 86 wins & 101 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BMTQ5NTg5ODk4OV5BMl5BanBnXkFtZTgwODc4MTMzMDE@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"7.7/10"},{"Source":"Rotten Tomatoes","Value":"89%"},{"Source":"Metacritic","Value":"89/100"}],"Metascore":"89","imdbRating":"7.7","imdbVotes":"136,928","imdbID":"tt2278871","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"France Télévision, Ciné+, France 2 Cinema, Wild Bunch, Centre du Cinéma et de l&#39;Audiovisuel de la Fédération Wallonie-Bruxelles, Quat&#39;sous Films, Canal+, Scope Pictures, Eurimages, Le Tax Shelter du Gouvernement Fédéral de Belgique, Région Nord-Pas-de-Calais, Pictanovo, France 2 (FR2), Vertigo Films, Centre National de la Cinematographie, Radio Télévision Belge Francofone (RTB)","Website":"N/A","Response":"True"}