{"Title":"Stefan Zweig: Farewell to Europe","Year":"2016","Rated":"N/A","Released":"12 May 2017","Runtime":"106 min","Genre":"Biography, Drama, History","Director":"Maria Schrader","Writer":"Maria Schrader (screenplay), Jan Schomburg (screenplay)","Actors":"Tómas Lemarquis, Barbara Sukowa, Valerie Pachner, Robert Finster","Plot":"In 1936, Stefan Zweig, the illustrious author of \" 24 Hours of a Woman's Life\" and \"Letter from an Unknown Woman\", leaves Austria for South America. Being Jewish and hating the inhumanity that prevails in Germany while threatening his native country, he has decided to escape the specter of Nazism. Brazil is his chosen country. He is immediately hailed at Rio de Janeiro's Jockey Club by the local jet set. But whereas expect him to take sides and to make a statement against Hitler and his clique, Zweig refuses to renounce his humanity and to indulge in over-simplification: he just cannot condemn Germany and its people. On the other hand, the great writer literally falls in love with Brazil and undertakes the writing of a new book about the country. Accompanied by Lotte, his second wife he explores different regions, including the most remote ones...","Language":"Russian, German, English, Portuguese, French, Spanish","Country":"Austria, Germany, France","Awards":"5 wins & 10 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BYzE4MzFhMDQtYmQ2ZS00MGU5LTkzNmItMmEzODc1YWQwNGI2XkEyXkFqcGdeQXVyMjY1OTYyMDA@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"6.8/10"},{"Source":"Rotten Tomatoes","Value":"93%"},{"Source":"Metacritic","Value":"75/100"}],"Metascore":"75","imdbRating":"6.8","imdbVotes":"2,023","imdbID":"tt3397160","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Westdeutscher Rundfunk, Maha Productions, Arte, Österreichischer Rundfunk (ORF) [at], Ideale Audience International, arte France Cinéma, X-Filme Creative Pool, Dor Film Produktionsgesellschaft, Bayerischer Rundfunk (BR)","Website":"N/A","Response":"True"}