{"Title":"DC Super Hero Girls: Hero of the Year","Year":"2016","Rated":"Not Rated","Released":"23 Aug 2016","Runtime":"76 min","Genre":"Animation, Action, Adventure, Comedy, Family, Fantasy, Sci-Fi","Director":"Cecilia Aranovich","Writer":"Shea Fontana, Jerry Siegel (based on the characters created by), Joe Shuster (based on the characters created by), William Moulton Marston (character created by: Wonder Woman), John Ostrander (character created by: Amanda Waller), John Byrne (character created by: Amanda Waller), Dan Mishkin (character created by: Amethyst), Ernie Colon (character created by: Amethyst), Gary Cohn (character created by: Amethyst), Arnold Drake (character created by: Beast Boy), Bob Rozakis (character created by: Bumblebee), Jose Delbo (character created by: Bumblebee), Marv Wolfman (characters created by: Cyborg & Starfire), George Pérez (characters created by: Cyborg & Starfire), Bob Haney (character created by: Eclipso), Jack Kirby (characters created by: Fourth World), Gerry Conway (character created by: Frost), Al Milgrom (character created by: Frost), Paul Dini (character created by: Harley Quinn), Bruce Timm (character created by: Harley Quinn), Gardner Fox (character created by: Hawkgirl), Denny O'Neil (character created by: Lady Shiva), Mike W. Barr (character created by: Katana), Jim Aparo (character created by: Katana), Geoff Johns (character created by: Miss Martian), Tony S. Daniel (character created by: Miss Martian)","Actors":"Yvette Nicole Brown, Dean Cain, Greg Cipes, Jessica DiCicco","Plot":"It's time for the annual Hero of the Year ceremony and the students of Super Hero High compete for the top prize. But the festivities take a turn when Dark Opal targets the heroes and steals some of their most valued possessions to form the ultimate weapon! It's up to the students at Super Hero High to spring into action! But can Wonder Woman, Supergirl, Batgirl and Bumblebee stop Dark Opal- and his mysterious partnerin- crime -to save the day?","Language":"English","Country":"USA","Awards":"4 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BMjk0N2VhOTYtMmQ3MC00ZjJiLWFhYmUtZDVhOWQzZDFkNTQ3XkEyXkFqcGdeQXVyNTk5Nzg0MDE@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.6/10"},{"Source":"Rotten Tomatoes","Value":"34%"}],"Metascore":"N/A","imdbRating":"5.6","imdbVotes":"571","imdbID":"tt5836262","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"Warner Bros. Animation, DC Entertainment","Website":"N/A","Response":"True"}