{"Title":"Lego DC Super Hero Girls: Brain Drain","Year":"2017","Rated":"Not Rated","Released":"25 Jul 2017","Runtime":"75 min","Genre":"Animation, Action, Adventure, Comedy, Family","Director":"Todd Grimes","Writer":"Jeremy Adams, James Krieg (story editor), John Ostrander (character created by: Amanda Waller), John Byrne (character created by: Amanda Waller), Arnold Drake (character created by: Beast Boy), Bob Rozakis (character created by: Bumblebee), Jose Delbo (character created by: Bumblebee), Marv Wolfman (character created by: Cyborg), George Pérez (character created by: Cyborg), Bob Haney (character created by: Eclipso), Paul Dini (character created by: Harley Quinn), Bruce Timm (character created by: Harley Quinn), Mike W. Barr (character created by: Katana), Jim Aparo (character created by: Katana), Jack Kirby (characters created by: Lashina & Mad Harriet), Jerry Siegel (based on the characters created by), Joe Shuster (based on the characters created by), William Moulton Marston (character created by: Wonder Woman), Roy Thomas (character created by: Wildcat), Todd McFarlane (character created by: Wildcat)","Actors":"Yvette Nicole Brown, Greg Cipes, Romi Dames, John DiMaggio","Plot":"The DC Super Girls go LEGO® in this animated adventure brimming with brain-twisting action! The mind games are only beginning when Supergirl, Wonder Woman, and Batgirl have no recollection of a series of wrongdoings that they were responsible for. Who can the girls turn to when even Bumblebee, Katana and other members of Super Hero High are also up to no good? It will take more than super powers to untangle this mental mix-up and find out who or what is behind these mind-bending misdoings! Get up and get your cape on for the ultimate in LEGO® girl power!","Language":"English","Country":"USA","Awards":"1 win & 4 nominations.","Poster":"https://m.media-amazon.com/images/M/MV5BZjYwODBmMDMtZDhlMy00MmRhLWE3YmUtOGNmMWQwOWMyYzI4XkEyXkFqcGdeQXVyNTM0MDc1ODE@._V1_SX300.jpg","Ratings":[{"Source":"Internet Movie Database","Value":"5.1/10"},{"Source":"Rotten Tomatoes","Value":"7%"}],"Metascore":"N/A","imdbRating":"5.1","imdbVotes":"315","imdbID":"tt7158814","Type":"movie","DVD":"N/A","BoxOffice":"N/A","Production":"DC Entertainment, Mattel, Warner Bros.","Website":"N/A","Response":"True"}